[
  {
    "id": 1,
    "name": "Hayatı Yeniden Keşfedin",
    "author": "Jeffrey E.Young ve Janet S.Klosko",
    "price": 19.25,
    "oldPrice": null,
    "description": "The creators of Schema Therapy, developed for entrenched personality issues with difficult treatment and scientifically proven effectiveness, are Jeffrey E. Young and Janet S. Klosko. They help you recognize your schemas through tests and assist you in changing them with the revolutionary principles of Cognitive Therapy, without the need for medication and lengthy traditional therapies.",
    "starRate": 5,
    "reviewCount": 1789,
    "stock": 2800,
    "imgSource": "./images/books/nutuk.jpg",
    "type": "HISTORY"
  },
  {
    "id": 2,
    "name": "The Alchemist",
    "author": "Harper Collins",
    "price": 11.7,
    "oldPrice": null,
    "description": "Dreams are made to be followed. Life is meant to be lived. Some books are meant to be read. Loved and passed on. The Alchemist is one of those books. It is the story of a shepherd boy from the Spanish region of Andalusia who dreams of travelling the world in search of a treasure as desirable as any ever found. From his home he journeys to the exotic markets of North Africa and then into the Egyptian desert, where a fateful encounter with the alchemist awaits him… The Alchemist is an unforgettable fable about the essential wisdom of listening to our heart and, above all, following our dreams.",
    "starRate": 4.7,
    "reviewCount": 330,
    "stock": 7,
    "imgSource": "./images/books/hayvan-ciftligi.jpg",
    "type": "NOVEL"
  },
  {
    "id": 3,
    "name": "Zengin Baba Yoksul Baba",
    "author": "Robert T. Kiyosaki ",
    "price": 44.9,
    "oldPrice": null,
    "description": "Bize okul sistemlerinin parayla ilgili öğrettiklerine neden güvenmememiz gerektiğini hatırlatır ve bu önemli yeteneğin neden bugün hiç olmadığı kadar önemli olduğunu açıklar.Çocuklarınıza paraya dair neler öğretmeniz gerektiğini açıklar, böylece onlar da günümüz dünyasının zorluklarına ve fırsatlarına kendilerini hazırlayabilir ve hak ettikleri zengin yaşamı sürebilir.",
    "starRate": 4.2,
    "reviewCount": 130,
    "stock": 3,
    "imgSource": "./images/books/zengin-baba-yoksul-baba.jpg",
    "type": "FINANCE"
  },
  {
    "id": 4,
    "name": "Açlık Oyunları 3 - Alaycı Kuş",
    "author": "Suzanne Collins",
    "price": 40.89,
    "oldPrice": null,
    "description": "Biz yanarsak, siz de bizimle yanacaksınız!",
    "starRate": 4.2,
    "reviewCount": 560,
    "stock": 6,
    "imgSource": "./images/books/alayci-kus.jpg",
    "type": "NOVEL"
  },
  {
    "id": 5,
    "name": "Hep Hayır! Diyen Çocuk",
    "author": " Charlie Griffin",
    "price": 9.99,
    "oldPrice": 14.5,
    "description": "Hep 'Hayır!' Diyen Çocuk Kurallardan pek hoşlanmayan Berk, bir gün her şeye Hayır! demeye başladı. Kalkıp giyinmeye Hayır! Banyo keyfine Hayır! Güzel yiyeceklere Hayır! Annesinin aklına bir fikir geldi. Bakalım hep Hayır! Diyen Berk'i ikna edebilecek mi?",
    "starRate": 3.7,
    "reviewCount": 410,
    "stock": 450,
    "imgSource": "./images/books/hep-hayir-diyen-cocuk.jpg",
    "type": "CHILDREN"
  },
  {
    "id": 6,
    "name": "Avcunuzdaki Kelebek",
    "author": "Ahmet Şerif İzgören ",
    "price": 22.99,
    "oldPrice": null,
    "description": "Tebrikler! Çok net başka bir şey söylemem mümkün değil. Sanırım hızlı okuma rekoru kırmış olabilirim. Bu kadar duygu yüklü, bu kadar gerçekleri gözler önüne serebilen, hala umut olabileceğine dair bu kadar mesaj bir arada nasıl verilir, gerçekten tebrikler",
    "starRate": 4.3,
    "reviewCount": 145,
    "stock": 321,
    "imgSource": "./images/books/avucunuzdaki-kelebek.jpg",
    "type": "SELFIMPROVEMENT"
  },
  {
    "id": 7,
    "name": "The Shack",
    "author": "Fyodor Mihayloviç Dostoyevski ",
    "price": 13.29,
    "oldPrice": null,
    "description": "Selling 18 million copies worldwide, THE SHACK is an international bestseller that explores life's most difficult questions through the gripping story of one man's struggle to find answers to his suffering. Mack's youngest daughter, Missy, is kidnapped during a family vacation and is proof that it could be her. Brutally murdered, he was found in an abandoned cabin deep in the Oregon wilderness. Four years later, still in thrall to his great sadness, Mack receives a suspicious note, apparently from God, inviting him back to the cabin. Against his better judgment, Mack arrives at the cabin one winter afternoon. What he finds there will change his life forever. SHACK wrestles with a timeless question: “Where is God in a world of inexplicable suffering?”",
    "starRate": 4.3,
    "reviewCount": 173,
    "stock": 73,
    "imgSource": "./images/books/kumarbaz.jpg",
    "type": "NOVEL"
  },

  {
    "id": 8,
    "name": "Utangaç Ayı Monti",
    "author": "Duncan Beedie",
    "price": 16.99,
    "oldPrice": null,
    "description": "Evvel zaman içinde bir ayı vardı Monti’ydi onun adı. Gözlerini dikip bakmaya, herkesi seyretmeye bayılırdı. Aslında Ayı Monti kabalık etmek istemiyordu, ama öyle meraklıydı ki kendini tutamıyordu...",
    "starRate": 4.3,
    "reviewCount": 189,
    "stock": 89,
    "imgSource": "./images/books/utangac-ayi-monti.jpg",
    "type": "CHILDREN"
  },
  {
    "id": 9,
    "name": "Kara Delikler",
    "author": "Stephen Hawking",
    "price": 19.99,
    "oldPrice": 34.5,
    "description": "2016 yılının BBC Reith derslerinde Stephen Hawking, bütün bir ömür süren araştırmalarını on beş dakika içinde aktarma gibi gerçekten zorlu bir meydan okumayı kabul etti. Bu çok kısa süren derslerde Hawking, evrenin gizemlerini ortaya sererken, kara delikleri anladığımız takdirde uzayzamanın sırlarına erişebileceğimizi vurguluyor.",
    "starRate": 2,
    "reviewCount": 78,
    "stock": 80,
    "imgSource": "./images/books/kara-delikler.jpg",
    "type": "SCIENCE"
  },
  {
    "id": 10,
    "name": "İnsan Geleceğini Nasıl Kurar?",
    "author": "İlber Ortaylı",
    "price": 34.99,
    "oldPrice": 47.49,
    "description": "İnsan Geleceğini Nasıl Kurar? yaşam tecrübesini paylaşmayı vazife bilen bir entelektüelden, İlber Hoca’dan, okurlar için bir yol açma, yol yapma, kendini inşa etme ve toplumu ayağa kaldırma rehberi. Platon, Seneca, Cicero, Farabi gibi bilgelerin ilhamı eşliğinde ve Yenal Bilgici’nin sorularıyla…",
    "starRate": 4.5,
    "reviewCount": 250,
    "stock": 14,
    "imgSource": "./images/books/insan-gelecegini-nasil-kurar.jpg",
    "type": "SELFIMPROVEMENT"
  },
  {
    "id": 11,
    "name": "Hayvanlardan Tanrılara - Sapiens",
    "author": "Yuval Noah Harari ",
    "price": 52.29,
    "oldPrice": 65,
    "description": "İsrailli Yazar ve Tarih Profesörü Yuval Noah Harari’nin kaleme aldığı Hayvanlardan Tanrılara Sapiens, son yılların en çok ses getiren kitapları arasında yer alıyor. Başlangıçtan bugüne insanın tarihsel yolculuğunu ele alan eser, bugünü meydana getiren tüm koşulları fenni ve sosyal bilimler ışığında detaylandırıyor",
    "starRate": 4.2,
    "reviewCount": 480,
    "stock": 490,
    "imgSource": "./images/books/sapiens.jpg",
    "type": "HISTORY"
  },
  {
    "id": 12,
    "name": "Savaş ve Barış",
    "author": "Tolstoy",
    "price": 24.6,
    "oldPrice": null,
    "description": "Eğer herkes sadece kendi inanışları için savaşsaydı, savaş olmazdı...",
    "starRate": 4.4,
    "reviewCount": 930,
    "stock": 143,
    "imgSource": "./images/books/savas-ve-baris.jpg",
    "type": "NOVEL"
  }
]
